app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2019-01-14 11:53:43.296030"], ["updated_at", "2019-01-14 11:53:43.296030"]]
---
  def create
    Post.create(title:
       params[:post][:title],
       description: params[:post][:description])